[
    {
        "title": "Vignette detection and reconstruction of composed ornaments with a strengthened autoencoder",
        "authors": "Mohammad Sadil Khan , Rémi Emonet , Thierry Fournel",
        "conference": "HAL Priprint",
        "year": 2021,
        "abstract": "A strengthened autoencoder formed by placing an object detector upstream of a decoder is here developed in the context of the model-helped human analysis of composed ornaments from a dictionary of vignettes. The detection part is in charge to detect regions of interest containing some vignette features, and the decoding part to ensure vignette reconstruction with a relative quality depending on feature match. Images of ornaments without typographical composition are generated in order to properly assess the performance of each of the two parts.",
        "paperLink": "https://hal.science/hal-03409930",
        "categories": "Deep Learning, Computer Vision, Object Detection, SSD"
    },
    {
        "title": "Learning Shapes for Efficient Segmentation of 3D Medical Images using Point Cloud",
        "authors": "Mohammad Sadil Khan, Razmig Kéchichian, Sebastien Valette, Julie Digne",
        "conference": "Master Thesis",
        "year": 2022,
        "codeLink": "https://github.com/SadilKhan/Creatis-Internship",
        "abstract": "In this report, we present a novel approach for 3D medical image segmentation using point clouds. 3D Convolutional Neural Networks have been the most dominating networks in medical image processing but they require large memory footprints and training samples. Hence we used point clouds to represent the image instead of voxels. Point clouds are lightweight and contain shape and smoother surface information. We extracted the point clouds from 3D voxel images using canny edge detection. We modified RandLa-Net, an attention-based point cloud segmentation network with a feature extraction layer to aggregate local geometrical features with spatial point features for our large-scale point cloud segmentation task. Our proposed model performed better than the original network in multi-class as well as binary point cloud segmentation tasks in Visceral dataset. Finally, we propose a model-independent step to perform the image segmentation of the original 3D volumetric images in Visceral dataset by mapping voxels in the point cloud space and adding it to the input point cloud before being passed to the trained model. We performed many experiments on the weights of the Cross-Entropy loss function for the class imbalance problem as well as the intrinsic architectural properties of the model architecture like downsampling factor and distinct latent vector learning that can be improved to perform better segmentation.",
        "paperLink": "data/report.pdf",
        "categories": "Deep Learning, Point Cloud, Representation Learning, RandLa-Net"
    }
]