[
    {
        "title": "SHARP Challenge 2023: Solving CAD History and pArameters Recovery from Point clouds and 3D scans. Overview, Datasets, Metrics, and Baselines",
        "authors": " Dimitrios Mallis, Sk Aziz Ali, Elona Dupont, Kseniya Cherenkova, Ahmet Serdar Karadeniz, Mohammad Sadil Khan, Anis Kacem, Gleb Gusev, Djamila Aouada",
        "conference": "ICCV Workshop 2023",
        "year": 2023,
        "codeLink": "https://gitlab.uni.lu/cvi2/iccv2023-sharp-challenge",
        "poster": "https://skazizali.com/assets/pdf/SHARP_ICCV23_Poster.pdf",
        "bibtex": "@inproceedings{AliSHARP_ICCV23,title = {SHARP Challenge 2023: Solving CAD History and pArameters Recovery from Point clouds and 3D scans. Overview, Datasets, Metrics, and Baselines},author = {Mallis, Dimitrios and Ali, Sk Aziz and Dupont, Elona and Cherenkova, Kseniya and Karadeniz, Ahmet Serdar and Kacem, Mohammed Sadil Khan Anis and Gusev, Gleb and Aouada, Djamila},booktitle = {In IEEE/CVF International Conference on Computer Vision (ICCV)},year = {2023},organization = {IEEE},}",
        "arxiv": "https://arxiv.org/abs/2308.07153",
        "abstract": "Recent breakthroughs in geometric Deep Learning (DL) and the availability of large Computer-Aided Design (CAD) datasets have advanced the research on learning CAD modeling processes and relating them to real objects. In this context, 3D reverse engineering of CAD models from 3D scans is considered to be one of the most sought-after goals for the CAD industry. However, recent efforts assume multiple simplifications limiting the applications in real-world settings. The SHARP Challenge 2023 aims at pushing the research a step closer to the real-world scenario of CAD reverse engineering through dedicated datasets and tracks. In this paper, we define the proposed SHARP 2023 tracks, describe the provided datasets, and propose a set of baseline methods along with suitable evaluation metrics to assess the performance of the track solutions. All proposed datasets along with useful routines and the evaluation metrics are publicly available. ",
        "paperLink": "https://paperswithcode.com/paper/sharp-challenge-2023-solving-cad-history-and",
        "categories": "Deep Learning, Computer Vision, Representation Learning, CAD",
        "image": "data/sharp2023.png",
         "metadata": ""
    },
    {
        "title": "CAD-SIGNet: CAD Language Inference from Point Clouds using Layer-wise Sketch Instance Guided Attention",
        "authors": "Mohammad Sadil Khan, Elona Dupont, Sk Aziz Ali, Kseniya Cherenkova, Anis Kacem, Djamila Aouada",
        "conference": "CVPR 2024 (Highlight)",
        "year": 2024,
        "project": "http://skazizali.com/cadsignet.github.io/",
        "codeLink": "",
        "poster": "https://cvpr.thecvf.com/media/PosterPDFs/CVPR%202024/30538.png?t=1716992823.610076",
        "bibtex": "@InProceedings{{Khan_2024_CVPR,author = {Khan, Mohammad Sadil and Dupont, Elona and Ali, Sk Aziz and Cherenkova, Kseniya and Kacem, Anis and Aouada, Djamila}, title = {CAD-SIGNet: CAD Language Inference from Point Clouds using Layer-wise Sketch Instance Guided Attention}, booktitle = {Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR)},month = {June},year = {2024},pages = {4713-4722}}",
        "arxiv": "https://arxiv.org/pdf/2402.17678.pdf",
        "abstract": "",
        "paperLink": "https://openaccess.thecvf.com/content/CVPR2024/papers/Khan_CAD-SIGNet_CAD_Language_Inference_from_Point_Clouds_using_Layer-wise_Sketch_CVPR_2024_paper.pdf",
        "categories": "Deep Learning, Computer Vision, Point Cloud, Representation Learning, RandLa-Net, CAD, Vision-Language Modeling",
        "image": "data/cad_signet.png",
        "metadata": "An autoregressive architecture for generating CAD sequence from Point cloud."
    }
]
